SunCity/src/Catalogs/СоответствиеВидовОплатыСККМOffline/СоответствиеВидовОплатыСККМOffline.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствиеВидовОплатыСККМOffline</name>
  <attributes>
    <name>ВидЭлектроннойОплатыПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВидыОплатЧекаККМ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовОплаты</name>
    <attributes>
      <name>КодВидаОплатыККМOffline</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплатЧекаККМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/Catalogs/СоответствиеВидовОплатыСККМOffline/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает вид оплаты по коду вида оплаты ККМ
//
// Параметры:
//  СсылкаНаСоответствие - СправочникСсылка.СоответствиеВидовОплатыСККМOffline - ссылка на соответствие видов оплаты.
//  КодВидаОплатыККМ - Число - код вида оплаты ККМ.
//
Функция ПолучитьВидОплатыПоКодуВидаОплатыККМ(СсылкаНаСоответствие, КодВидаОплатыККМ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаСоответствие) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты.ВидОплаты КАК ВидОплаты
	|ИЗ
	|	Справочник.СоответствиеВидовОплатыСККМOffline.СоответствиеВидовОплаты КАК СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты
	|ГДЕ
	|	СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты.Ссылка = &СсылкаНаСоответствие
	|	И СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты.КодВидаОплатыККМOffline = &КодВидаОплатыККМOffline";
	
	Запрос.УстановитьПараметр("КодВидаОплатыККМOffline", КодВидаОплатыККМ);
	Запрос.УстановитьПараметр("СсылкаНаСоответствие", СсылкаНаСоответствие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ВидОплаты;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
